---
kind: method
id: M:Autodesk.Revit.DB.ConnectorSet.GetEnumerator
source: html/be8bf394-4825-b905-ebf3-e5c220958ec5.htm
---
# Autodesk.Revit.DB.ConnectorSet.GetEnumerator Method

Retrieve a forward moving iterator to the set.

## Syntax (C#)
```csharp
public virtual IEnumerator GetEnumerator()
```

## Returns
Returns a forward moving iterator to the set.